{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "directionality": "bidi",
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "\u0411\u0435\u0437 \u0415\u0413\u042d",
    "1": "\u0411\u044e\u0434\u0436\u0435\u0442",
    "2": "\u041a\u043e\u043d\u0442\u0430\u043a\u0442\u044b",
    "3": "\u041e\u0431\u0443\u0447\u0435\u043d\u0438\u0435",
    "4": "\u041e\u0431\u0449\u0435\u0436\u0438\u0442\u0438\u0435",
    "5": "\u041f\u043e\u0441\u0442\u0443\u043f\u043b\u0435\u043d\u0438\u0435",
    "6": "\u0421\u0442\u043e\u0438\u043c\u043e\u0441\u0442\u044c",
    "7": "\u0424\u043e\u0440\u043c\u044b \u043e\u0431\u0443\u0447\u0435\u043d\u0438\u044f"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "\u0411\u0435\u0437 \u0415\u0413\u042d": 0,
    "\u0411\u044e\u0434\u0436\u0435\u0442": 1,
    "\u041a\u043e\u043d\u0442\u0430\u043a\u0442\u044b": 2,
    "\u041e\u0431\u0443\u0447\u0435\u043d\u0438\u0435": 3,
    "\u041e\u0431\u0449\u0435\u0436\u0438\u0442\u0438\u0435": 4,
    "\u041f\u043e\u0441\u0442\u0443\u043f\u043b\u0435\u043d\u0438\u0435": 5,
    "\u0421\u0442\u043e\u0438\u043c\u043e\u0441\u0442\u044c": 6,
    "\u0424\u043e\u0440\u043c\u044b \u043e\u0431\u0443\u0447\u0435\u043d\u0438\u044f": 7
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "output_past": true,
  "pad_token_id": 0,
  "pooler_fc_size": 768,
  "pooler_num_attention_heads": 12,
  "pooler_num_fc_layers": 3,
  "pooler_size_per_head": 128,
  "pooler_type": "first_token_transform",
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "transformers_version": "4.57.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 119547
}
